/**
 * Created by swallow on 2017/7/9.
 */

var list = [
  '游戏',
  '运动',
  '互联网',
  '艺术',
  '阅读',
  '美食',
  '动漫',
  '汽车',
  '生活方式',
  '教育',
  '摄影',
  '历史',
  '文化',
  '旅行',
  '职业发展',
  '经济学',
  '足球',
  '篮球',
  '投资',
  '音乐',
  '电影',
  '法律',
  '自然科学',
  '设计',
  '创业',
  '健康',
  '商业',
  '体育',
  '科技',
  '化学',
  '物理学',
  '生物学',
  '金融'
]
var jinrong = [
  '美股',
  '金融学',
  '风险投资',
  '注册会计师',
  '余额宝',
  '支付宝',
  '证券',
  '股票',
  '理财',
  '天使投资',
  '银行',
  '保险',
  '期货',
  '投资银行',
  '证券投资',
  '互联网金融',
  '基金',
  '外汇投资',
  '股票市场',
  '税收',
  '个人理财'
]
for (let i = 0; i < jinrong.length; i++) {
  db.topics.insert({
    'name': jinrong[i]
  })
}

for (let i = 0; i < 50; i++) {
  db.problems.insert({
    'title': `测试实例 ${i}`,
    'describle': '7.15转用测试描述'
  })
}
